html/docker/kubernates-handbook/theory/cluster/annotation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Annotation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="label.html"> UP </a>
 |
 <a accesskey="H" href="cluster.html"> HOME </a>
</div><div id="content">
<h1 class="title">Annotation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org00521fe">关联元数据到对象</a></li>
<li><a href="#orgc2a8ce1">示例</a></li>
</ul>
</div>
</div>
<p>
Annotation，顾名思义，就是注解。Annotation 可以将 <span class="underline">Kubernetes 资源对象</span> <b>关联</b> 到 <span class="underline">任意的非标识性元数据</span>
</p>

<pre class="example" id="orgcce168b">
使用客户端（如工具和库）可以检索到这些元数据
</pre>
<div id="outline-container-org00521fe" class="outline-2">
<h2 id="org00521fe">关联元数据到对象</h2>
<div class="outline-text-2" id="text-org00521fe">
<p>
Label 和 Annotation 都可以将元数据关联到 Kubernetes 资源对象：
</p>
<ul class="org-ul">
<li>Label 主要用于选择对象，可以挑选出满足特定条件的对象。annotation 不能用于标识及选择对象</li>
<li>annotation 中的元数据可多可少，可以是结构化的或非结构化的</li>
<li>annotation 也可以包含 label 中不允许出现的字符</li>
</ul>

<p>
Annotation 和 label 一样都是 key/value 键值对映射结构：
</p>
<pre class="example" id="org6852e07">
json"annotations": {"key1":"value1","key2":"value2"}
</pre>

<p>
以下列出了一些可以记录在 annotation 中的对象信息：
</p>
<ul class="org-ul">
<li><p>
声明配置层管理的字段
</p>
<pre class="example" id="org17cf84f">
可以用于区分以下几种配置来源：客户端或服务器设置的默认值，自动生成的字段或自动生成的 auto-scaling 和 auto-sizing 系统配置的字段
</pre></li>
<li><p>
创建信息、版本信息或镜像信息
</p>
<pre class="example" id="orgeac8052">
例如时间戳、版本号、git 分支、PR 序号、镜像哈希值以及仓库地址
</pre></li>
<li>记录日志、监控、分析或审计存储仓库的指针</li>
<li><p>
可以用于 debug 的客户端（库或工具）信息
</p>
<pre class="example" id="orgb368a92">
例如名称、版本和创建信息
</pre></li>
<li><p>
用户信息，以及工具或系统来源信息
</p>
<pre class="example" id="orga4f7247">
例如来自非 Kubernetes 生态的相关对象的 URL 信息
</pre></li>
<li><p>
轻量级部署工具元数据
</p>
<pre class="example" id="org15d74e9">
例如配置或检查点
</pre></li>
<li><p>
负责人的电话或联系方式，或能找到相关信息的目录条目信息
</p>
<pre class="example" id="orgd8be7c1">
例如团队网站
</pre></li>
</ul>

<pre class="example" id="org401e379">
如果不使用 annotation，也可以将以上类型的信息存放在外部数据库或目录中

但这样做不利于创建用于部署、管理、内部检查的共享工具和客户端库
</pre>
</div>
</div>

<div id="outline-container-orgc2a8ce1" class="outline-2">
<h2 id="orgc2a8ce1">示例</h2>
<div class="outline-text-2" id="text-orgc2a8ce1">
<p>
如 Istio 的 Deployment 配置中就使用到了 annotation：
</p>

<pre class="example" id="orgf129cd8">
apiVersion: extensions/v1beta1
kind: Deployment
metadata:
  name: istio-manager
spec:
  replicas: 1
  template:
    metadata:
      annotations:
	alpha.istio.io/sidecar: ignore
      labels:
	istio: manager
    spec:
      serviceAccountName: istio-manager-service-account
      containers:
      - name: discovery
	image: harbor-001.jimmysong.io/library/manager:0.1.5
	imagePullPolicy: Always
	args: ["discovery", "-v", "2"]
	ports:
	- containerPort: 8080
	env:
	- name: POD_NAMESPACE
	  valueFrom:
	    fieldRef:
	      apiVersion: v1
	      fieldPath: metadata.namespace
      - name: apiserver
	image: harbor-001.jimmysong.io/library/manager:0.1.5
	imagePullPolicy: Always
	args: ["apiserver", "-v", "2"]
	ports:
	- containerPort: 8081
	env:
	- name: POD_NAMESPACE
	  valueFrom:
	    fieldRef:
	      apiVersion: v1
	      fieldPath: metadata.namespace
</pre>

<p>
<span class="underline">alpha.istio.io/sidecar</span> 注解就是用来 <b>控制</b> 是否 <span class="underline">自动向 pod 中注入 sidecar 的</span>
</p>

<p>
<a href="taint_toleration.html">Next：Taint 和 Toleration</a>
</p>

<p>
<a href="label.html">Previous：Label</a>
</p>

<p>
<a href="cluster.html">Home：Cluster</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
